<template>
	<view>
		My Lifepay用户注册协议
		《My Lifepay用户注册协议》（以下简称“本协议”）由My Lifepay和用户（以下简称“您”或者“用户”）签订，本协议在您与My Lifepay之间具有合同上的法律效力。
		
		在您使用我们提供的服务之前，请您认真阅读本协议，尤其是本协议规定的“免责及责任限制”等条款将以加粗的形式体现，确保您充分理解本协议中各条款，并自主考虑风险。
		
		<br>1.	关于本协议的确认与接纳
		
		<br>1.1 您理解本协议及有关协议适用于My Lifepay及My Lifepay上所有自主开发和拥有的应用及服务。
		
		<br>1.2 您下载My Lifepay软件并绑定相关账号使用，即视为您已经充分阅读并接受本协议全部条款，本协议立即生效，对双方具有约束力。
		
		<br>1.3 本协议可由My Lifepay随时更新，经修改的协议一经公布，立即自动生效，恕不再另行通知。在My Lifepay公布修改协议条款后，如果您不接受修改后的条款，请立即停止使用My Lifepay，您继续使用My Lifepay将被视为接受修改后的协议。
		
		<br>1.4 在使用我们的服务前，请您确认您已满18周岁。
		
		<br>2名词解释
		<br>2.1&nbsp;用户：
		
		<br>（1）用户必须是具备完全民事行为能力的自然人；
		
		<br>（2）若您为18周岁以下的未成年人使用My Lifepay服务，需要在您父母或监护人的指导下使用My Lifepay。无民事行为能力人使用My Lifepay或限制民事行为能力人超过其民事权利或行为能力范围从事交易的，造成的一切后果，My Lifepay有权要求您及您的监护人负责。
		
		<br>2.2&nbsp;区块链：将数据区块以顺序相连的方式，组合而成的一种链式数据结构， 并以密码学的方式，保证其不可篡改和不可伪造的分布式账本。它使用块链式数据结构来验证与存储数据，使用分布式节点以及共识算法来生成和更新数据，使用密码学的方式保证数据传输和访问的安全，使用自动化脚本代码组成的智能合约来编程和操作数据，是一种全新的分布式基础架构与计算范式。
		
		<br>2.3&nbsp;区块链资产或数字资产：存在于区块链数据中的密码学账户中的数字，它被视为账户合法所有者的数字资产，包括但不限于比特币（Bitcoin）、以太坊（Ethereum）等。
		
		<br>2.4&nbsp;矿工费：用户进行区块链上资产转移的时候，向区块链矿工节点支付的交易确认费用，该费用收取方为矿工。
		
		<br>2.5&nbsp;个人信息：以电子或者其他方式记录的能够单独或者与其他信息结合识别用户个人身份的各种信息，包括但不限于自然人的姓名、出生日期、身份证件号码、个人生物识别信息、住址、电话号码、银行卡号、邮件地址、钱包地址、移动设备信息、操作记录、交易记录等，但不包括用户的钱包密码。
		
		<br>3.&nbsp;ID和密码的设定、使用、管理&nbsp;
		<br>(1)用户在My Lifepay完成用户注册并登录后，即可使用各项服务。&nbsp;
		
		<br>(2)用户应使用本人的手机号码注册登录My Lifepay钱包的ID。&nbsp;
		
		<br>(3)用户应根据My Lifepay的规定，基于个人情况负责地设置密码。&nbsp;
		
		<br>(4)对于在My Lifepay注册的ID和密码的管理、使用，用户应承担全部责任，用户应对使用自己的ID和密码而产生的一切行为后果承担责任，不应给本My Lifepay造成麻烦或损失。&nbsp;
		
		<br>(5)用户不得让第三方使用或向第三方出借、转让以及买卖ID和密码。&nbsp;
		
		<br>(6)用户需要修改姓名、地址、联系电话、电子邮件等注册信息时，应按照My Lifepay的修改流程进行修改。
		
		<br>(7)&nbsp;用户忘记ID或密码时，应遵循本My Lifepay流程找回密码。
		
		<br>(8)&nbsp;用户的ID和密码被盗或得知正在被第三方使用时，应立即通知本My Lifepay。当My Lifepay给出指示时，应依照指示执行、处理。&nbsp;
		&nbsp;
		<br>4.广告
		<br>4.1 您同意My Lifepay可以在提供服务的过程中自行或由第三方广告商向您发送广告、推广或宣传信息（包括商业与非商业信息），其方式和范围可不经向您特别通知而变更。
		
		<br>4.2 My Lifepay可能为您提供选择关闭广告信息的功能，但任何时候您都不得以本协议未明确约定或My Lifepay未书面许可的方式屏蔽、过滤广告信息。
		
		<br>4.3My Lifepay依照法律的规定对广告商履行相关义务，您应当自行判断广告信息的真实性并为自己的判断行为负责，除法律明确规定外，您因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，My Lifepay不承担责任。
		
		<br>4.4 您同意，对My Lifepay服务中出现的广告信息，您应审慎判断其真实性和可靠性，除法律明确规定外，您应对依该广告信息进行的交易负责。
		
		5.	风险提示
		
		5.1 您了解并知悉，由于数字资产领域的法律法规政策尚未健全，该领域的数字资产可能会产生无法兑现、技术不稳定、灭失等重大风险。且数字资产的价格波动幅度远高于其他金融资产。我们谨慎提醒您应当根据自身财务状况和风险偏好，理性选择持有或处置任何一种数字资产。
		
		5.2 在使用My Lifepay服务时，若您或您的相对方未遵从本协议或相关网站说明或交易、支付页面中之操作提示、规则，My Lifepay并不保证交易会顺利完成，且My Lifepay不承担损害赔偿责任。若发生前述情形，而款项已先行入账您的或您的交易方的My Lifepay钱包或第三方钱包，您理解区块链操作具有的“不可逆”属性，以及相关交易具有“不可撤销”的特征，由您及您的相对方自行承担相应的风险后果。
		
		5.3 在您使用My Lifepay集成的第三方应用服务或进行交易时，为了您的利益，My Lifepay建议您仔细阅读本协议及My Lifepay提示，了解交易对象及产品信息，谨慎评估风险后再采取行动。所有您在第三方应用进行的交易行为系您的个人行为，有约束力的合同关系在您和您的相对方之间建立，与My Lifepay无关。My Lifepay对因您的交易行为所引起的一切风险、责任、损失、费用不承担任何责任。
		
		5.4 您在交易过程中应当自行判断对方是否为完全民事行为能力人并自行决定是否与对方进行交易或转账给对方等，且您自行承担与此相关的所有风险。
		
		5.5 在转账过程中，如果出现“交易失败”、“打包超时”等类似的异常信息提示时，您应通过相关区块链系统的官方途径或其他的区块链查询工具进行再次确认，以避免重复转账；否则，由此所引起的一切损失和费用应由您自行承担。
		
		5.6 若您在保存钱包密码等信息的时候泄密，或保存或备份上述信息的设备或服务器被黑客攻击或控制等情况下，您的数字资产可能因此丢失，My Lifepay无法为您找回，您需自行承担相应损失。
		
		5.7&nbsp;我们建议您在安全的网络环境中使用My Lifepay，确保您的移动设备没有越狱或Root，以避免可能存在的安全隐患。
		
		5.8&nbsp;请您在使用我们的服务过程中，警惕非My Lifepay官方的诈骗行为。一旦发现此类行为，我们鼓励您第一时间告知我们。
		
		6.	服务的变更、终端、终止
		
		6.1 您同意My Lifepay为保证自主业务经营权可以暂时提供部分服务功能，或于将来暂停部分服务功能或开通新的服务功能。当任何功能减少或者增加或者变化时，只要您仍然使用My Lifepay提供的服务，表示您仍然同意本协议或者本协议修正后的条款。
		
		6.2 您理解存在如下情形时，My Lifepay将暂停提供服务：
		
		（1）因设备、区块链系统维修、升级、故障和通信中断等技术原因而中断业务；
		
		（2）因台风、地震、海啸、洪水、停电、战争或恐怖袭击等不可抗力因素，病毒、木马、黑客攻击、系统不稳定或政府行为等原因，造成My Lifepay系统不能提供服务或My Lifepay合理认为继续提供服务会有较大风险的；
		
		（3）发生My Lifepay无法控制或合理预见的其他情形。
		
		6.3 当您出现如下情况时，My Lifepay可单方面中止或终止您使用My Lifepay的部分或全部功能:
		
		（1）用户死亡；
		
		（2）盗用他人的钱包信息或移动设备；
		
		（3）您提供的个人资料不真实；
		
		（4）拒绝My Lifepayl为提升My Lifepay功能而发起的强制更新操作；
		
		（5）将My Lifepay用于违法或犯罪活动；
		
		（6）妨碍其他用户正常使用；
		
		（7）伪称My Lifepay的工作人员或管理人员；
		
		（8）攻击、侵入、更改或以任何其他方式威胁My Lifepay计算机系统的正常运作；
		
		（9）利用My Lifepay宣传垃圾广告；
		
		（10）散布谣言，损害My Lifepay商誉；
		
		（11）违法行为，其他违反本协议的行为，及My Lifepay合理认为应当暂停功能的情形；
		
		（12）用户将自己的用户权利向第三方进行转让、出售、过户、抵押或用来提供其他担保等；&nbsp;
		（13）不正当使用或让他人使用ID或密码，延期支付或不支付产品费用的情况下&nbsp;；
		
		（14）付款时，因关联的信用卡失效或其他原因而造成无法正常结算的情况下&nbsp;；
		
		（15）通过电话、传真、电子邮件及其他联系方式都无法与用户取得联系的情况下&nbsp;；
		
		（16）违反本协议中任何一项规定的情况下&nbsp;；
		
		（17）My Lifepay认为其他不妥的理由存在的情况下&nbsp;。
		
		6.4因My Lifepay采取前项中的措施而造成该用户无法正常使用各项服务的情况下，对于该用户或第三方的损失，本My Lifepay不承担任何责任。&nbsp;
		
		7.	您合法使用My Lifepay服务的承诺
		
		7.1 您应遵守您所居住的国家或地区的法律法规，不得将My Lifepay用于任何非法目的，也不得以任何非法方式使用My Lifepay 服务。
		
		7.2 您不得利用My Lifepay从事违法或犯罪的行为，包括但不限于：
		
		（1）危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的；
		
		（2）从事任何违法犯罪行为，包括但不限于洗钱、非法集资等；
		
		（3）通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具，接入My Lifepay 服务、收集或处理My Lifepay 所提供的内容，干预或试图干预任何用户或任何其他方式接入My Lifepay 服务的行为；
		
		（4）提供赌博资讯或以任何方式引诱他人参与赌博；
		
		（5）侵入他人My Lifepay钱包盗取数字资产；
		
		（6）进行与交易对方宣称的交易内容不符的交易，或不真实的交易；
		
		（7）从事任何侵害或可能侵害My Lifepay服务系统、数据之行为；
		
		（8）其他违法以及My Lifepay 有正当理由认为不适当的行为。
		
		7.3 您理解并同意，如因您违反有关法律（包括但不限于海关及税务方面的监管规定）或者本协议之规定，使My Lifepay 遭受任何损失、受到任何第三方的索赔或任何行政管理部门的处罚，您应对My Lifepay 进行赔偿，包括为主张权利所付出的律师费在内的全部合理费用。
		
		7.4 您承诺按时缴纳My Lifepay 的服务费用（如有），否则My Lifepay 有权暂停或中止对您提供的服务。
		
		8.	免责及责任限制
		
		8.1 My Lifepay仅对本协议中所列明的义务承担责任。
		
		8.2 您理解和同意，在法律所允许的范围内，My Lifepay只能按照现有的技术水平和条件提供服务。因下列原因导致My Lifepay无法正常提供服务，My Lifepay不承担责任：
		
		（1）My Lifepay系统停机维护或升级；
		
		（2）因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；
		
		（3）您的移动设备软硬件和通信线路、供电线路出现故障的；
		
		（4）您操作不当或未通过My Lifepay授权或认可的方式使用My Lifepay服务的；
		
		（5）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行等原因或政府行为等原因；
		
		（6）非因My Lifepay的原因而引起的任何其它原因。
		
		8.3 My Lifepay对以下情形不承担责任：
		
		（1）因用户遗失移动设备、删除且未备份钱包、钱包被盗或遗忘钱包密码而导致的数字资产丢失；
		
		（2）因用户自行泄露钱包密码，或借用、转让或授权他人使用自己的移动设备或My Lifepay钱包，或未通过My Lifepayl官方渠道下载My Lifepay应用程序或其他不安全的方式使用My Lifepay应用程序导致的数字资产丢失；
		
		（3）因用户误操作（包括但不限于您输错转账地址、您自身选择转账节点服务器的问题）导致的数字资产丢失；
		
		（4）因用户不理解区块链技术的性质而进行误操作导致的数字资产丢失；
		
		（5）因时间滞后、区块链系统不稳定等原因导致My Lifepayl拷贝用户在区块链上的交易记录发生偏差；
		
		（6）用户在第三方应用上操作产生的风险和后果。
		
		8.4 您理解My Lifepay仅作为您数字资产管理的工具。My Lifepay不能控制第三方应用提供的产品及服务的质量、安全或合法性，信息的真实性或准确性，以及相对方履行其在与您签订的协议项下的各项义务的能力。所有您在第三方应用进行的交易行为系您的个人行为，有约束力的合同关系在您和您的相对方之间建立，与My Lifepay无关。My Lifepay提醒您应该通过自己的谨慎判断确定登录应用及相关信息的真实性、合法性和有效性。您与任何第三方交易所产生的风险亦应由您自行承担。
		
		8.5 My Lifepay可能同时为您及您的交易对手方提供服务，您同意对My Lifepay可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张My Lifepay在提供服务时存在法律上的瑕疵，也不因此而加重My Lifepay的责任或注意义务。
		
		8.6 My Lifepay不提供以下形式的保证：
		
		（1）My Lifepay服务将符合您的全部需求；
		
		（2）您经由My Lifepay服务取得的任何技术、产品、服务、资讯将符合您的期望；
		
		（3）My Lifepay从第三方交易所抓取的数字资产市场交易行情等信息的及时性、准确性、完整性、可靠性做出保证；
		
		（4）您在My Lifepay上的交易各方会及时履行其在与您达成的交易协议中各项义务。
		
		8.7&nbsp;您理解My Lifepay仅作为用户管理数字资产、显示交易信息的工具，My Lifepay不提供法律、税务或投资建议等服务。您应当自行向法律、税务、投资方面的专业人士寻求建议，且您在使用我们服务过程中所遭受的投资损失、数据损失等，My Lifepay概不负责。
		
		8.8&nbsp;您理解根据有关本地政策法规的要求，我们可能不时更改我们的用户准入标准，限定向某一特定群体提供服务的范围和方式等。
		
		9.	知识产权保护
		
		9.1	My Lifepay系My Lifepay开发并拥有知识产权的应用程序。 My Lifepay中显示的任何内容（包括但不限于本协议、公告、文章、视频、音频、图片、档案、资讯、资料、商标或标识）的知识产权归My Lifepay或第三方权利人所有。用户仅可为持有和管理数字资产之目的使用My Lifepay应用程序及其中的内容。未经My Lifepay或第三方权利人的事先书面同意，任何人不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表上述应用程序及内容。
		
		10.	协议期限
		&nbsp;&nbsp;
		10.1 您和我们定立的这份协议是无固定期限协议，如果您做出以下行为，我们有权随时终止合约并立即生效：
		
		（1）您触犯或违反本协议中的任何条款；
		
		（2）我们认为您滥用应用程序或服务。
		
		11.	法律适用及争议解决
		
		11.1 本协议及其修订版之效力、解释、变更、执行与争议解决均适用大不列颠及北爱尔兰联合王国法律，如无相关法律规定，则应当适用国际商业惯例和（或）行业惯例。
		
		11.2 若您和My Lifepay之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，任何一方可提交My Lifepay所在地有管辖权的法院管辖。
		
		12.	其他
		
		12.1 您需全面了解并遵守您所在司法辖区与使用My Lifepay服务所有相关法律、法规及规则。
		
		12.2 您在使用My Lifepay服务过程中，如遇到任何问题，您可以通过在My Lifepay提交反馈等方式联系我们。
		
		12.3 您可以在My Lifepay中查看本协议。 My Lifepay鼓励您在每次访问My Lifepay时都查阅My Lifepay的服务协议。
		
		12.4&nbsp;本协议的任何译文版本仅为方便用户而提供，无意对本政策的条款进行修改。如果本政策的中文版本与非中文版本之间存在冲突，应以中文版本为准。
		
		13．法律依据&nbsp;
		关于本协议的成立、效力、执行和解释均符合中华人民共和国法律规定。&nbsp;
		
		14．管辖&nbsp;
		用户与My Lifepay之间就本协议产生的一切纠纷应由My Lifepay公司所在地法院管辖。&nbsp;
		
		本协议未尽事宜，您需遵守My Lifepay不时更新的公告及相关规则。
		
	</view>
</template>

<script>
</script>

<style>
</style>
